org/archive/blog.org_archive
#    -*- mode: org -*-

** TODO Quick Notes
:PROPERTIES:
:export_file_name: random-notes
:END:
Collection of notes from various sources, rather than keeping it in a separate org file, this makes it handy for global lookups.
*** Compiler Design
Source: [[http://aosabook.org/en/llvm.html][AOSA - LLVM]] \\
Three phase static compiler design:
1. FrontEnd
   Parses the source code, checks for errors and builds language specific AST to represent input code.
2. Optimizer
   Performs a variety of operations that improve code's run time, usually independent of the language and target.
3. Backend
   AKA code generator, maps code onto target instruction set ensuring its /correct/ and /optimized/. Common parts are instruction selection, register allocation and instruction scheduling.
*** Interpreter in Go
Source: [[https://github.com/jablonskidev/writing-an-interpreter-in-go][Github - Jablonskidev]]
Change representation of source code twice before evaluation \\
  Source code — (Lexing) \rightarrow Tokens — (Parsing) \rightarrow AST
**** Lexing
+ Types of tokens: Numbers, Variable names, Keywords, Special Characters etc.
+ Need a =token= data structure having /types/ to differentitate different types and /fields/ that store a token's literal value.
+ Lexer treats the source code as a string, goes through it and throws out the tokens.
**** Parsing
+ Parser turns its /input/ into a /data structure/ (AST) that represents the input.
+ Abstract because some (parsing guiding) elements of source not present in AST.
+ Syntactic Analysis
*** SSH setup (iSH)
**** iSH (Only works for local access rn :/)
+ =apk add opnssh=
+ =apk add mosh=
+ =ssh-keygen -t rsa=
+ On server: =ip addr show | sed -n 's/.*inet \([0-9.]*\).*/\1/p' | grep -v '127.0.0.1'=
+ =ssh-copy-id user@host=, then enter machine passwd
+ =mosh user@host=
+ > =vi .ssh/config=, then add this
  #+begin_src conf
Host <alias>
      Hostname <host>
      Port <port>
      User <user>
  #+end_src
+ Then you can just do =mosh <alias>=

